Tekla.Structures.Catalogs.PrinterItem
The PrinterItem class contains information about the printers in the Tekla Structures catalog.

Tekla.Structures.Catalogs.PrinterItem.#ctor
Creates a new printer item instance.

Tekla.Structures.Catalogs.PrinterItem.Name
The printer item's name which Tekla Structures uses
to fetch all the item's default properties in the printing process.

Tekla.Structures.Catalogs.PrinterItem.Device
The actual printer device used in the printing.

Tekla.Structures.Catalogs.PrinterItem.Extension
The printer item's default file extension which is used when printing to a file.

Tekla.Structures.Catalogs.PrinterItem.PrintAreaWidth
The printer item's print area width.

Tekla.Structures.Catalogs.PrinterItem.PrintAreaHeigth
The printer item's print area height.